stevenj/avr-libc3/include/avr/io/atmega16hvb.h
/* Charge Over-current Protection Activated Interrupt Enable */
typedef enum BATTERY_PROTECTION_COCIE_enum
{
    BATTERY_PROTECTION_COCIE_CLEAR_gc = (0x00), /* Charge Over-current Protection Activated Interrupt Enable - CLEAR */
    BATTERY_PROTECTION_COCIE_SET_gc   = (0x04), /* Charge Over-current Protection Activated Interrupt Enable - SET */
} BATTERY_PROTECTION_COCIE_t;

/* Discharger High-current Protection Activated Interrupt */
typedef enum BATTERY_PROTECTION_DHCIE_enum
{
    BATTERY_PROTECTION_DHCIE_CLEAR_gc = (0x00), /* Discharger High-current Protection Activated Interrupt - CLEAR */
    BATTERY_PROTECTION_DHCIE_SET_gc   = (0x02), /* Discharger High-current Protection Activated Interrupt - SET */
} BATTERY_PROTECTION_DHCIE_t;

/* Charger High-current Protection Activated Interrupt */
typedef enum BATTERY_PROTECTION_CHCIE_enum
{
    BATTERY_PROTECTION_CHCIE_CLEAR_gc = (0x00), /* Charger High-current Protection Activated Interrupt - CLEAR */
    BATTERY_PROTECTION_CHCIE_SET_gc   = (0x01), /* Charger High-current Protection Activated Interrupt - SET */
} BATTERY_PROTECTION_CHCIE_t;

/*
--------------------------------------------------------------------------------
CHARGER_DETECT - Charger Detect
--------------------------------------------------------------------------------
*/

typedef struct CHARGER_DETECT_struct
{
    register8_t rsv_0x00[212]; /* RESERVED REGISTER BLOCK */
    register8_t CHGDCSR;       /* Charger Detect Control and Status Register */
} CHARGER_DETECT_t;


/* BATT Pin Voltage Level */
typedef enum CHARGER_DETECT_BATTPVL_enum
{
    CHARGER_DETECT_BATTPVL_CLEAR_gc = (0x00), /* BATT Pin Voltage Level - CLEAR */
    CHARGER_DETECT_BATTPVL_SET_gc   = (0x10), /* BATT Pin Voltage Level - SET */
} CHARGER_DETECT_BATTPVL_t;

/* Charger Detect Interrupt Sense Control */
#define CHARGER_DETECT_CHGDCSR_CHGDISC_gc(x) ((x<<2) & 0x0C)

/* Charger Detect Interrupt Flag */
typedef enum CHARGER_DETECT_CHGDIF_enum
{
    CHARGER_DETECT_CHGDIF_CLEAR_gc = (0x00), /* Charger Detect Interrupt Flag - CLEAR */
    CHARGER_DETECT_CHGDIF_SET_gc   = (0x02), /* Charger Detect Interrupt Flag - SET */
} CHARGER_DETECT_CHGDIF_t;

/* Charger Detect Interrupt Enable */
typedef enum CHARGER_DETECT_CHGDIE_enum
{
    CHARGER_DETECT_CHGDIE_CLEAR_gc = (0x00), /* Charger Detect Interrupt Enable - CLEAR */
    CHARGER_DETECT_CHGDIE_SET_gc   = (0x01), /* Charger Detect Interrupt Enable - SET */
} CHARGER_DETECT_CHGDIE_t;

/*
--------------------------------------------------------------------------------
VOLTAGE_REGULATOR - Voltage Regulator
--------------------------------------------------------------------------------
*/

typedef struct VOLTAGE_REGULATOR_struct
{
    register8_t rsv_0x00[200]; /* RESERVED REGISTER BLOCK */
    register8_t ROCR;          /* Regulator Operating Condition Register */
} VOLTAGE_REGULATOR_t;


/* ROC Status */
typedef enum VOLTAGE_REGULATOR_ROCS_enum
{
    VOLTAGE_REGULATOR_ROCS_CLEAR_gc = (0x00), /* ROC Status - CLEAR */
    VOLTAGE_REGULATOR_ROCS_SET_gc   = (0x80), /* ROC Status - SET */
} VOLTAGE_REGULATOR_ROCS_t;

/* ROC Disable */
typedef enum VOLTAGE_REGULATOR_ROCD_enum
{
    VOLTAGE_REGULATOR_ROCD_CLEAR_gc = (0x00), /* ROC Disable - CLEAR */
    VOLTAGE_REGULATOR_ROCD_SET_gc   = (0x10), /* ROC Disable - SET */
} VOLTAGE_REGULATOR_ROCD_t;

/* ROC Warning Interrupt Flag */
typedef enum VOLTAGE_REGULATOR_ROCWIF_enum
{
    VOLTAGE_REGULATOR_ROCWIF_CLEAR_gc = (0x00), /* ROC Warning Interrupt Flag - CLEAR */
    VOLTAGE_REGULATOR_ROCWIF_SET_gc   = (0x02), /* ROC Warning Interrupt Flag - SET */
} VOLTAGE_REGULATOR_ROCWIF_t;

/* ROC Warning Interrupt Enable */
typedef enum VOLTAGE_REGULATOR_ROCWIE_enum
{
    VOLTAGE_REGULATOR_ROCWIE_CLEAR_gc = (0x00), /* ROC Warning Interrupt Enable - CLEAR */
    VOLTAGE_REGULATOR_ROCWIE_SET_gc   = (0x01), /* ROC Warning Interrupt Enable - SET */
} VOLTAGE_REGULATOR_ROCWIE_t;

/*
--------------------------------------------------------------------------------
BANDGAP - Bandgap
--------------------------------------------------------------------------------
*/

typedef struct BANDGAP_struct
{
    register8_t rsv_0x00[208]; /* RESERVED REGISTER BLOCK */
    register8_t BGCCR;         /* Bandgap Calibration Register */
    register8_t BGCRR;         /* Bandgap Calibration of Resistor Ladder */
    register8_t BGCSR;         /* Bandgap Control and Status Register */
} BANDGAP_t;


/* Bandgap Disable */
typedef enum BANDGAP_BGD_enum
{
    BANDGAP_BGD_CLEAR_gc = (0x00), /* Bandgap Disable - CLEAR */
    BANDGAP_BGD_SET_gc   = (0x20), /* Bandgap Disable - SET */
} BANDGAP_BGD_t;

/* Bandgap Short Circuit Detection Enabled */
typedef enum BANDGAP_BGSCDE_enum
{
    BANDGAP_BGSCDE_CLEAR_gc = (0x00), /* Bandgap Short Circuit Detection Enabled - CLEAR */
    BANDGAP_BGSCDE_SET_gc   = (0x10), /* Bandgap Short Circuit Detection Enabled - SET */
} BANDGAP_BGSCDE_t;

/* Bandgap Short Circuit Detection Interrupt Flag */
typedef enum BANDGAP_BGSCDIF_enum
{
    BANDGAP_BGSCDIF_CLEAR_gc = (0x00), /* Bandgap Short Circuit Detection Interrupt Flag - CLEAR */
    BANDGAP_BGSCDIF_SET_gc   = (0x02), /* Bandgap Short Circuit Detection Interrupt Flag - SET */
} BANDGAP_BGSCDIF_t;

/* Bandgap Short Circuit Detection Interrupt Enable */
typedef enum BANDGAP_BGSCDIE_enum
{
    BANDGAP_BGSCDIE_CLEAR_gc = (0x00), /* Bandgap Short Circuit Detection Interrupt Enable - CLEAR */
    BANDGAP_BGSCDIE_SET_gc   = (0x01), /* Bandgap Short Circuit Detection Interrupt Enable - SET */
} BANDGAP_BGSCDIE_t;

/*
--------------------------------------------------------------------------------
CPU - CPU Registers
--------------------------------------------------------------------------------
*/

typedef struct CPU_struct
{
    register8_t rsv_0x00[55]; /* RESERVED REGISTER BLOCK */
    register8_t OSICSR;       /* Oscillator Sampling Interface Control and Status Register */
    register8_t rsv_0x38[6];  /* RESERVED REGISTER BLOCK */
    register8_t GPIOR0;       /* General Purpose IO Register 0 */
    register8_t rsv_0x3F[11]; /* RESERVED REGISTER BLOCK */
    register8_t GPIOR1;       /* General Purpose IO Register 1 */
    register8_t GPIOR2;       /* General Purpose IO Register 2 */
    register8_t rsv_0x4C[7];  /* RESERVED REGISTER BLOCK */
    register8_t SMCR;         /* Sleep Mode Control Register */
    register8_t MCUSR;        /* MCU Status Register */
    register8_t MCUCR;        /* MCU Control Register */
    register8_t rsv_0x56[7];  /* RESERVED REGISTER BLOCK */
    _REGISTER16 (SP);         /* Stack Pointer  */
    register8_t rsv_0x5E;     /* RESERVED REGISTER */
    register8_t SREG;         /* Status Register */
    register8_t rsv_0x60;     /* RESERVED REGISTER */
    register8_t CLKPR;        /* Clock Prescale Register */
    register8_t rsv_0x62[2];  /* RESERVED REGISTER BLOCK */
    register8_t PRR0;         /* Power Reduction Register 0 */
    register8_t rsv_0x65;     /* RESERVED REGISTER */
    register8_t FOSCCAL;      /* Fast Oscillator Calibration Value */
    register8_t rsv_0x67[23]; /* RESERVED REGISTER BLOCK */
    register8_t DIDR0;        /* Digital Input Disable Register */
} CPU_t;


/* Global Interrupt Enable */
typedef enum CPU_I_enum
{
    CPU_I_CLEAR_gc = (0x00), /* Global Interrupt Enable - CLEAR */
    CPU_I_SET_gc   = (0x80), /* Global Interrupt Enable - SET */
} CPU_I_t;

/* Bit Copy Storage */
typedef enum CPU_T_enum
{
    CPU_T_CLEAR_gc = (0x00), /* Bit Copy Storage - CLEAR */
    CPU_T_SET_gc   = (0x40), /* Bit Copy Storage - SET */
} CPU_T_t;

/* Half Carry Flag */
typedef enum CPU_H_enum
{
    CPU_H_CLEAR_gc = (0x00), /* Half Carry Flag - CLEAR */
    CPU_H_SET_gc   = (0x20), /* Half Carry Flag - SET */
} CPU_H_t;

